thermo-emacs-latex.org
* LaTeX

Most of these ideas come from [[http://www.stefanom.org/setting-up-a-nice-auctex-environment-on-mac-os-x/][this article]].

First we do the usual loading.

#+BEGIN_SRC emacs-lisp
(load "auctex.el" nil t t)
(load "preview-latex.el" nil t t)
#+END_SRC

Next, we do the basic recommended settings. 

#+BEGIN_SRC emacs-lisp
(setq TeX-autqo-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
#+END_SRC

Of course I set PDF mode as the default.

#+BEGIN_SRC emacs-lisp
(setq TeX-PDF-mode t)
#+END_SRC

I load reftex, enanbling it in all LaTeX modes and in markdown mode too.

#+BEGIN_SRC emacs-lisp
(require 'reftex)
(add-hook 'markdown-mode-hook 'turn-on-reftex)

(setq reftex-plug-into-AUCTeX t)
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)   ; with AUCTeX LaTeX mode
(add-hook 'latex-mode-hook 'turn-on-reftex)   ; with Emacs latex mode
#+END_SRC

Configure latexmk support:

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path (expand-file-name "auctex-latexmk" dotfiles-dir))
(require 'auctex-latexmk)
(auctex-latexmk-setup)
#+END_SRC

** docTeX

Lately I've been writing some ~.dtx~ files, and I'm learning to use AUCTeX's default docTeX-mode. Here is set a keyboard shorcut to automatically add a new commented line (so no need to press enter and then the comment character)

#+BEGIN_SRC emacs-lisp
(eval-after-load "latex"
'(define-key docTeX-mode-map (kbd "\C-c j") 'comment-indent-new-line))
#+END_SRC
